scripts/test-obterEstado.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="https://factura-agt.vercel.app/facturacao/v1">
  <soapenv:Header/>
  <soapenv:Body>
    <tns:ObterEstadoRequest>
      <schemaVersion>1.0</schemaVersion>
      <taxRegistrationNumber>123456789</taxRegistrationNumber>
      <requestID>AGT-20251227-32d94997</requestID>
      <submissionTimeStamp>2025-12-27T10:00:00Z</submissionTimeStamp>
      <jwsSignature>PLACEHOLDER_JWS_256_CHARS_IF_NEEDED</jwsSignature>
      <softwareInfo>
        <softwareInfoDetail>
          <productId>TEST_SOFT</productId>
          <productVersion>1.0</productVersion>
          <softwareValidationNumber>VAL-TEST</softwareValidationNumber>
        </softwareInfoDetail>
        <jwsSoftwareSignature>...</jwsSoftwareSignature>
      </softwareInfo>
    </tns:ObterEstadoRequest>
  </soapenv:Body>
</soapenv:Envelope>